
public class ExerciseFourteen {

	/*
	 * Имате предварително въведен едномерен масив, съдържащ реални числа. Да се
	 * състави програма, чрез която се избират само елементи със стойности от
	 * интервала [-2.99..2.99] и новата редица се извежда на екрана. 
	 * Пример:
	 * 7.1,8.5,0.2,3.7,0.99,1.4,-3.5,-110,212,341,1.2
	 *  Изход:
	 *  0.2; 0.99; 1.4; 1.2
	 */

	public static void main(String[] args) {

		double[] array = { 7.1, 8.5, 0.2, 3.7, 0.99, 1.4, -3.5, -110, 212, 341, 1.2 };

		for (int i = 0; i < array.length; i++) {
			if (array[i] < -2.99 || array[i] > 2.99) {
				continue;
			} else {
				System.out.print(array[i] + "; ");
			}

		}

	}

}
